## 6.16

### c++代码规范

头文件都要使用 #pragma once 防护符防止重复导入。

禁止使用usingnamespace xxx，很容易导致符号冲突。

类的公有接口必须明确指明该类是可拷贝的、仅可移动的、还是既不可拷贝也不可移动的。

用struct 定义那些用于储存数据的被动对象。

组合(composition)比继承(inheritance)更合适。

不希望类被继承，使用final关键字。

文件名、变量、参数、数据成员   小写+下划线     my_useful_class

类名、函数名    驼峰式     MyExcitingclass

结构体变量   小写    name

常量命名、枚举   k驼峰式    kDaysInAWeek

宏定义    大写+下划线     #define PI_ROUNDED



### 指针

（存地址 地址对应数据类型） 
指针本质上是一个无符号整数（unsigned integer），存储的是内存地址。



### malloc、realloc、free

##### 1.调用realloc发生什么

扩充：
当前内存块后面**有**足够的连续空闲空间   **原地扩展**，返回的指针与 ptr 相同
**没**有足够的连续空间   堆上重新分配一块**新内存**，原数据拷贝，释放原内存，返回**新指针**（在realloc或vector等**容器默认左值拷贝**，如果移动构造函数被标记noexcept右值移动）
缩小：
**原地**缩小多余的空间被释放，返回原指针
扩展：考虑内存分配失败情况，用临时指针接收判断一下

##### 2.free

free(ptr);// 释放内存

**ptr= NULL;**//将指针置为NULL，避免悬挂指针

##### 3.为什么free时候却不需要传递长度信息呢?

会在内存的头部或附近额外分配**一小块空间**，用来**记录**这块**内存关键信息**（这是一种内存管理机制）
块的大小： size 
状态标志：标识内存是已 分配/空闲
指向前后块的指针：用于管理空闲链表。

##### 4.malloc更底层的原理是什么?一次malloc底层都经历了什么?

**用户**态（ptmalloc 分配器）：（通过空闲链表、bins等结构）管理已申请的堆内存，复用内存减少系统调用。

**内核**态（Linux 内核）：通过brk或mmap系统调用真正分配虚拟地址空间。Lazy Allocation（延迟物理内存分配）。

-  brk或sbrk在进程的堆区（heap）末尾扩展，只需**移动**程序中断（program break）指针
-  mmap在进程地址空间中**映射一块独立**的内存区域，与堆区分离，释放时直接 munmap
- brk/mmap **返回**后，**虚拟地址已分配**，但物理内存尚未被真正占用。只是建立了虚拟地址到磁盘或空占位的映射。
- 程序**第一次访问**，触发缺页中断，CPU检测到缺页陷入内核，检查虚地址是否有效（是否在进程地址空间中已分配）有效且是首次访问，内核**真正分配物理内存页**，更新页表，建立虚拟地址到该物理页的映射

在 **Linux 独有的系统调用追踪工具 **`strace` 去追踪系统调用过程（大mmap/小brk）



### 内存布局（堆 vs 栈）

##### 1.什么场景下使用栈，什么场景下使用堆呢？


struct Test {
    Test(int) { std::cout << "普通构造 int\n"; }
    Test(std::initializer_list<int>) { std::cout << "initializer_list 构造\n"; }
};

int main() {
    Test t1(10);    // 普通构造 int
    Test t2 = 10;   // 赋值初始化，普通构造 int
    Test t3{10};    // 优先 initializer_list 构造
}
```



### 强制类型转换

C 强制类型转换

`（(type)expression）`

C++ 四种强制类型转换

`static_cast<type>(expression)` 静态  基本数据类型、对象指针（有明确继承关系且安全）、有转换函数的类对象

`dynamic_cast<type>(expression)` 动态  基类的指针转为派生类指针（基类必须要有虚函数），因为dynamic_cast是运行时检查需要RTTI，RTTI存储在虚函数表中，如果基类没有虚函数或者转换双方不是继承关系dynamic_cast 转换失败时会返回空指针（指针）或抛出异常（引用）

 `const_cast<type>(expression)`   修改类型的const或volatile属性

`reinterpret_cast<type>(expression)）`   强制类型转换

```
float f=1.23;
int i=static_cast<int>(f);//ok
int* p=&i;
float* q=static_cast<float*>(p);//error
//static_cast不能用于有类型指针间转换,可以用于 基类/派生类 指针间转换
```



### 函数调用原理

计算机内：小端  网络传输：大端

##### 函数调用

每一次**函数调用**，都会在**调用栈**上开辟一块独立内存区域栈帧。程序运行时，栈从高地址向低地址增长。

1.压参数  2.压旧ip 3.更新ip  4.压bp  5.bp移到sp  6.sp下移减小分配了被调函数栈帧  7.执行函数   8.sp回退到bp 9.出栈恢复旧bp 10.出栈恢复旧ip 11.出栈参数

![image-20260629191601751](./assets/image-20260629191601751.png)

##### 内联函数

inline 编译器将函数代码**原地展开**在调用处，不生成独立函数实体。无调用开销（压栈、跳转、栈帧创建销毁）只是**建议**，必须在**头文件定义**。

##### 递归函数

函数**自调用**，递归必然产生栈调用，编译器才能展开



### 多态原理

##### 常见问题

**虚继承**：解决**菱形继承**问题

**虚函数表**中有**两个析构**函数：标志为deleting/complete，因为**对象有两种构造方式栈构造和堆构造**。所以对应的实现上对象也有**两种析构**方式，栈会自动被回收，堆内存的析构需要执行delete函数。

**构造不能**为虚函数：构造时才创建虚表

**析构需要为**虚函数：基类指针指向派生类，析构时调用对应派生类析构函数才能完全释放资源

**Base类和Derived类：各自有**独立**的vtable，地址不同**，Derived的vtable会包含Base的扩展和修改（在它基础上修改）。**对象包含的vptr**始终指向**当前类的vtable**。

<img src="./assets/image-20260629200558619.png" alt="image-20260629200558619" style="zoom:50%;" />

##### 底层原理

![image-20260629200820289](./assets/image-20260629200820289.png)

<img src="./assets/image-20260629200734504.png" alt="image-20260629200734504" style="zoom:50%;" />

例子：菱形虚继承

```
#include <cstdio>
struct Base
{
    Base() = default;
    virtual ~Base() = default;
    void FuncA() {}
    virtual void FuncB() { printf("Base FuncB\n"); }
    int a;
    int b;
};
struct BaseA : virtual public Base
{
    BaseA() = default;
    virtual ~BaseA() = default;
    void FuncA() {}
    virtual void FuncB() { printf("BaseA FuncB\n"); }
    int a;
    int b;
};
struct BaseB : virtual public Base
{
    BaseB() = default;
    virtual ~BaseB() = default;
    void FuncA() {}
    virtual void FuncC() { printf("BaseB FuncC\n"); }
    int a;
    int b;
};
struct Derive : public BaseB, public BaseA
{
    void FuncB() override { printf("Derive FuncB \n"); }
    void FuncC() override { printf("Derive FuncC \n"); }
};
int main()
{
    BaseA a;
    Derive d;
    return 0;
}

//sizeof(Derive) = 48
*** Dumping AST Record Layout
0 | struct Derive
0 |   struct BaseB (primary base)
0 |     (BaseB vtable pointer)
8 |      int a
12 |     int b
16 |   struct BaseA (base)
16 |     (BaseA vtable pointer)
24 |     int a
28 |     int b
32 |   struct Base (virtual base)
32 |     (Base vtable pointer)
40 |     int a
44 |     int b
    | [sizeof=48, dsize=48, align=8,
    |  nvsize=32, nvalign=8]
*** Dumping IRgen Record Layout


//Derive 全局虚表 vtable 
Vtable for 'Derive' (20 entries).
0  | vbase_offset (32)              	 //Derive*/BaseB*
1  | offset_to_top (0)
2  | Derive RTTI
     -- (BaseB, 0) vtable address --
     -- (Derive, 0) vtable address --
3  | Derive::~Derive() [complete]
4  | Derive::~Derive() [deleting]
5  | void Derive::FuncC()
6  | void Derive::FuncB()
7  | vbase_offset (16)              	  //BaseA*
8  | offset_to_top (-16)
9  | Derive RTTI
     -- (BaseA, 16) vtable address --
10 | Derive::~Derive() [complete]
     [this adjustment: -16 non-virtual]
11 | Derive::~Derive() [deleting]
     [this adjustment: -16 non-virtual]
12 | void Derive::FuncB()
     [this adjustment: -16 non-virtual]
13 | vcall_offset (-32)  				  //Base*
14 | vcall_offset (-32)  //vcal1_offset跟虚基类中的虚函数个数是一一对应的。
15 | offset_to_top (-32) //每个虚函数在运行时需独立计算它的this指针的偏移量。
16 | Derive RTTI
     -- (Base, 32) vtable address --
17 | Derive::~Derive() [complete]
     [this adjustment: 0 non-virtual, -24 vcall offset offset]
18 | Derive::~Derive() [deleting]
     [this adjustment: 0 non-virtual, -24 vcall offset offset]
19 | void Derive::FuncB()
     [this adjustment: 0 non-virtual, -32 vcall offset offset]
```

虚继承编译器生成了复杂的**Thunk(桩代码)和offset偏移量机制**，目的是为了能够在**任何情况下都可以正确访问对象**。

![image-20260629210738222](./assets/image-20260629210738222.png)

<img src="./assets/image-20260629210919124.png" alt="image-20260629210919124" style="zoom:80%;" />

![image-20260629210901438](./assets/image-20260629210901438.png)

##### 构造过程vptr变化

构造和析构中调用虚函数---到底会发生什么？

![image-20260629212019469](./assets/image-20260629212019469.png)

##### final

修饰虚函数 **禁止子类重写虚函数**

修饰类  **禁止该类被任何类继承**

##### override

重写基类的虚函数，让编译器强制校验签名一致性。基类对应 `virtual`、函数名、参数、`const`/`volatile`、返回值（协变）完全匹配。



### 继承 多继承 多态

为什么类的static数据成员一定要在类外初始化呢?

